HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxPsi5_regdef.h
/** \brief PSI5 object */
typedef volatile struct _Ifx_PSI5
{
       Ifx_PSI5_CLC                        CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_PSI5_ID                         ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_PSI5_FDR                        FDR;                    /**< \brief C, PSI5 Fractional Divider Register*/
       Ifx_PSI5_FDRL                       FDRL;                   /**< \brief 10, Fractional Divider Register for Lower Bit Rate*/
       Ifx_PSI5_FDRH                       FDRH;                   /**< \brief 14, Fractional Divider Register for Higher Bit Rate*/
       Ifx_PSI5_FDRT                       FDRT;                   /**< \brief 18, Fractional Divider Register for Time Stamp*/
       Ifx_PSI5_TSRA                       TSRA;                   /**< \brief 1C, Module Time Stamp Register A*/
       Ifx_PSI5_TSRB                       TSRB;                   /**< \brief 20, Time Stamp Register B*/
       Ifx_PSI5_TSRC                       TSRC;                   /**< \brief 24, Module Time Stamp Register C*/
       Ifx_UReg_8Bit                       reserved_28[4];         /**< \brief 28, \internal Reserved */
       Ifx_PSI5_GCR                        GCR;                    /**< \brief 2C, Global Control Register*/
       Ifx_PSI5_CH                         CH[2];                  /**< \brief 30, */
       Ifx_UReg_8Bit                       reserved_150[424];      /**< \brief 150, \internal Reserved */
       Ifx_PSI5_INTOV                      INTOV;                  /**< \brief 2F8, Interrupt Overview Register*/
       Ifx_PSI5_INP                        INP[2];                 /**< \brief 2FC, Interrupt Node Pointer Register ${x}*/
       Ifx_UReg_8Bit                       reserved_304[12];       /**< \brief 304, \internal Reserved */
       Ifx_PSI5_INTSTATA                   INTSTATA[2];            /**< \brief 310, Interrupt Status Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_318[12];       /**< \brief 318, \internal Reserved */
       Ifx_PSI5_INTSTATB                   INTSTATB[2];            /**< \brief 324, Interrupt Status Register B ${x}*/
       Ifx_UReg_8Bit                       reserved_32C[12];       /**< \brief 32C, \internal Reserved */
       Ifx_PSI5_INTSETA                    INTSETA[2];             /**< \brief 338, Interrupt Set Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_340[12];       /**< \brief 340, \internal Reserved */
       Ifx_PSI5_INTSETB                    INTSETB[2];             /**< \brief 34C, Interrupt Set Register B ${x}*/
       Ifx_UReg_8Bit                       reserved_354[12];       /**< \brief 354, \internal Reserved */
       Ifx_PSI5_INTCLRA                    INTCLRA[2];             /**< \brief 360, Interrupt Clear Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_368[12];       /**< \brief 368, \internal Reserved */
       Ifx_PSI5_INTCLRB                    INTCLRB[2];             /**< \brief 374, Interrupt Clear Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_37C[12];       /**< \brief 37C, \internal Reserved */
       Ifx_PSI5_INTENA                     INTENA[2];              /**< \brief 388, Interrupt Enable Register A ${x}*/
       Ifx_UReg_8Bit                       reserved_390[12];       /**< \brief 390, \internal Reserved */
       Ifx_PSI5_INTENB                     INTENB[2];              /**< \brief 39C, Interrupt Enable Register B ${x}*/
       Ifx_UReg_8Bit                       reserved_3A4[40];       /**< \brief 3A4, \internal Reserved */
       Ifx_PSI5_OCS                        OCS;                    /**< \brief 3CC, OCDS Control and Status*/
       Ifx_PSI5_ACCEN0                     ACCEN0;                 /**< \brief 3D0, Access Enable Register 0*/
       Ifx_PSI5_ACCEN1                     ACCEN1;                 /**< \brief 3D4, Access Enable Register 1*/
       Ifx_PSI5_KRST0                      KRST0;                  /**< \brief 3D8, Kernel Reset Register 0*/
       Ifx_PSI5_KRST1                      KRST1;                  /**< \brief 3DC, Kernel Reset Register 1*/
       Ifx_PSI5_KRSTCLR                    KRSTCLR;                /**< \brief 3E0, Kernel Reset Status Clear Register*/
       Ifx_PSI5_RFC                        RFC[2];                 /**< \brief 3E4, Receive FIFO Control Register ${x}*/
       Ifx_UReg_8Bit                       reserved_3EC[12];       /**< \brief 3EC, \internal Reserved */
       Ifx_PSI5_RDF                        RDF[2];                 /**< \brief 3F8, Receive Data FIFO ${x}*/
       Ifx_UReg_8Bit                       reserved_400[12];       /**< \brief 400, \internal Reserved */
       Ifx_PSI5_RSIOV                      RSIOV[2];               /**< \brief 40C, RSI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_414[12];       /**< \brief 414, \internal Reserved */
       Ifx_PSI5_RMIOV                      RMIOV[2];               /**< \brief 420, RMI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_428[12];       /**< \brief 428, \internal Reserved */
       Ifx_PSI5_NBIOV                      NBIOV[2];               /**< \brief 434, NBI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_43C[12];       /**< \brief 43C, \internal Reserved */
       Ifx_PSI5_TEIOV                      TEIOV[2];               /**< \brief 448, TEI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_450[12];       /**< \brief 450, \internal Reserved */
       Ifx_PSI5_CRCIOV                     CRCIOV[2];              /**< \brief 45C, CRCI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_464[12];       /**< \brief 464, \internal Reserved */
       Ifx_PSI5_RDIOV                      RDIOV[2];               /**< \brief 470, RDI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_478[12];       /**< \brief 478, \internal Reserved */
       Ifx_PSI5_NFIOV                      NFIOV[2];               /**< \brief 484, NFI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_48C[12];       /**< \brief 48C, \internal Reserved */
       Ifx_PSI5_MEIOV                      MEIOV[2];               /**< \brief 498, MEI Overview Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4A0[12];       /**< \brief 4A0, \internal Reserved */
       Ifx_PSI5_RSISET                     RSISET[2];              /**< \brief 4AC, RSI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4B4[12];       /**< \brief 4B4, \internal Reserved */
       Ifx_PSI5_RMISET                     RMISET[2];              /**< \brief 4C0, RMI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4C8[12];       /**< \brief 4C8, \internal Reserved */
       Ifx_PSI5_NBISET                     NBISET[2];              /**< \brief 4D4, NBI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4DC[12];       /**< \brief 4DC, \internal Reserved */
       Ifx_PSI5_TEISET                     TEISET[2];              /**< \brief 4E8, TEI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4F0[12];       /**< \brief 4F0, \internal Reserved */
       Ifx_PSI5_CRCISET                    CRCISET[2];             /**< \brief 4FC, CRCI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_504[12];       /**< \brief 504, \internal Reserved */
       Ifx_PSI5_RDISET                     RDISET[2];              /**< \brief 510, RDI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_518[12];       /**< \brief 518, \internal Reserved */
       Ifx_PSI5_NFISET                     NFISET[2];              /**< \brief 524, NFI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_52C[12];       /**< \brief 52C, \internal Reserved */
       Ifx_PSI5_MEISET                     MEISET[2];              /**< \brief 538, MEI Overview Set Register ${x}*/
       Ifx_UReg_8Bit                       reserved_540[12];       /**< \brief 540, \internal Reserved */
       Ifx_PSI5_RSICLR                     RSICLR[2];              /**< \brief 54C, RSI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_554[12];       /**< \brief 554, \internal Reserved */
       Ifx_PSI5_RMICLR                     RMICLR[2];              /**< \brief 560, RMI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_568[12];       /**< \brief 568, \internal Reserved */
       Ifx_PSI5_NBICLR                     NBICLR[2];              /**< \brief 574, NBI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_57C[12];       /**< \brief 57C, \internal Reserved */
       Ifx_PSI5_TEICLR                     TEICLR[2];              /**< \brief 588, TEI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_590[12];       /**< \brief 590, \internal Reserved */
       Ifx_PSI5_CRCICLR                    CRCICLR[2];             /**< \brief 59C, CRCI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5A4[12];       /**< \brief 5A4, \internal Reserved */
       Ifx_PSI5_RDICLR                     RDICLR[2];              /**< \brief 5B0, RDI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5B8[12];       /**< \brief 5B8, \internal Reserved */
       Ifx_PSI5_NFICLR                     NFICLR[2];              /**< \brief 5C4, NFI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5CC[12];       /**< \brief 5CC, \internal Reserved */
       Ifx_PSI5_MEICLR                     MEICLR[2];              /**< \brief 5D8, MEI Overview Clear Register ${x}*/
       Ifx_UReg_8Bit                       reserved_5E0[32];       /**< \brief 5E0, \internal Reserved */
       Ifx_PSI5_RDM                        RDM[4][32];             /**< \brief 600, */
       Ifx_UReg_8Bit                       reserved_A00[256];      /**< \brief A00, \internal Reserved */
} Ifx_PSI5;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXPSI5_REGDEF_H */
